Revit 2027 API
BuiltInFailures.SiteFailures.SurfaceSplitNoIntersection Property
 The splitting boundary must divide the Surface into separate pieces. There may be a gap in the splitting Lines or the Sketch may be incomplete.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SurfaceSplitNoIntersection { get; }
Public Shared ReadOnly Property SurfaceSplitNoIntersection As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SurfaceSplitNoIntersection {
	FailureDefinitionId^ get ();
}
static member SurfaceSplitNoIntersection : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SiteFailures Class
Autodesk.Revit.DB Namespace